FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ПерераспределениеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>БТ_ПерераспределениеДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БТ_ПланДДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодБюджета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Донор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реципиент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сценарий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/AccumulationRegisters/ПлатежныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПлатежныйКалендарь</Name>
			<Comment>Платежный календарь</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поступление</Name>
					<Comment>Сумма поступления планируемых ДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расход</Name>
					<Comment>Сумма планируемого расхода ДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеФакт</Name>
					<Comment>Сумма фактически поступивших ДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходФакт</Name>
					<Comment>Сумма фактического расхода ДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Структурная единица (касса компании или расчетный счет орагнизации) - место, где хранятся ДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыКомпании</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья движения денежных средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Comment>Документ-основание для поступления/выплаты ДС</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСделок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Comment>Документ планирования</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланПоступленияДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/БТ_ПерераспределениеДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПредставлениеПериодаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Объект.ПериодБюджета 	= ДобавитьМесяц(Объект.ПериодБюджета, ?(Направление, 1, -1));
	СтандартнаяОбработка 	= Ложь;                                                      
	
	ПредставлениеПериода 	= Формат(Объект.ПериодБюджета, "ДФ='MMMM yyyy ''г.'''");
	

КонецПроцедуры

&НаКлиенте
Процедура ДонорПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = истина;
КонецПроцедуры

&НаКлиенте
Процедура ДонорПередНачаломИзменения(Элемент, Отказ)
//	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицы(Команда)   
	
	Если Объект.Донор.Количество() Тогда
		
		Ответ = Вопрос("Очистить табличные чати?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			Объект.Донор.Очистить();
						
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьТаблицыНаСервере();     
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыНаСервере()
	
	Если не ЗначениеЗаполнено(Объект.ПериодБюджета) Тогда
		
		Сообщить("Не указан период бюджета");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ПланДДС.Сценарий КАК Сценарий,
		|	БТ_ПланДДС.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(БТ_ПланДДС.Сумма) КАК Сумма,
		|	БТ_ПланДДС.Организация КАК Организация,
		|	БТ_ПланДДС.ПодразделениеКомпании КАК Подразделение
		|ПОМЕСТИТЬ Планы
		|ИЗ
		|	РегистрНакопления.БТ_ПланДДС КАК БТ_ПланДДС
		|ГДЕ
		|	БТ_ПланДДС.Период < &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	БТ_ПланДДС.Сценарий,
		|	БТ_ПланДДС.СтатьяДДС,
		|	БТ_ПланДДС.Организация,
		|	БТ_ПланДДС.ПодразделениеКомпании
		|
		|ИМЕЮЩИЕ
		|	СУММА(БТ_ПланДДС.Сумма) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение КАК СтруктурнаяЕдиницаПодразделение,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение.Организация КАК СтруктурнаяЕдиницаПодразделениеОрганизация,
		|	ПлатежныйКалендарьОбороты.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(ПлатежныйКалендарьОбороты.РасходФактОборот) КАК РасходФактОборот
		|ПОМЕСТИТЬ Факт
		|ИЗ
		|	РегистрНакопления.ПлатежныйКалендарь.Обороты(&НачПериода, &Период, , ) КАК ПлатежныйКалендарьОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлатежныйКалендарьОбороты.СтатьяДДС,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение,
		|	ПлатежныйКалендарьОбороты.СтруктурнаяЕдиница.Подразделение.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Планы.Сценарий КАК Сценарий,
		|	Планы.СтатьяДДС КАК СтатьяДДС,
		|	Планы.Организация КАК Организация,
		|	Планы.Подразделение КАК Подразделение,
		|	СУММА(Планы.Сумма - ЕстьNULL(Факт.РасходФактОборот,0)) КАК Сумма
		|ИЗ
		|	Планы КАК Планы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Факт КАК Факт
		|		ПО Планы.СтатьяДДС = Факт.СтатьяДДС
		|			И Планы.Организация = Факт.СтруктурнаяЕдиницаПодразделениеОрганизация
		|			И Планы.Подразделение = Факт.СтруктурнаяЕдиницаПодразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	Планы.Организация,
		|	Планы.Сценарий,
		|	Планы.СтатьяДДС,
		|	Планы.Подразделение"; 
	
	Запрос.УстановитьПараметр("Период", 		КонецМесяца(Объект.ПериодБюджета)); 
	Запрос.УстановитьПараметр("НачПериода", 		НачалоМесяца(Объект.ПериодБюджета));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.Донор.Добавить(), ВыборкаДетальныеЗаписи);
		//ЗаполнитьЗначенияСвойств(Объект.Реципиент.Добавить(), ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Донор.Очистить();;
	Объект.Реципиент.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
Если Объект.Реципиент.Итог("Сумма") > Объект.Донор.Итог("Сумма") Тогда
		
		Отказ = истина;
		Сообщить("В таблице Реципиент, сумма превышает сумму донора, запись отменена");
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Донор.Сценарий КАК Сценарий,
		|	Донор.СтатьяДДС КАК СтатьяДДС,
		|	Донор.Сумма КАК Сумма,
		|	Донор.Организация КАК Организация,
		|	Донор.Подразделение КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ Донор
		|ИЗ
		|	&Донор КАК Донор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БТ_ПланДДС.Сценарий КАК Сценарий,
		|	БТ_ПланДДС.СтатьяДДС КАК СтатьяДДС,
		|	СУММА(БТ_ПланДДС.Сумма) КАК Сумма,
		|	БТ_ПланДДС.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	БТ_ПланДДС.Организация КАК Организация
		|ПОМЕСТИТЬ ВБазе
		|ИЗ
		|	РегистрНакопления.БТ_ПланДДС КАК БТ_ПланДДС
		|ГДЕ
		|	БТ_ПланДДС.Период < &Период
		|
		|СГРУППИРОВАТЬ ПО
		|	БТ_ПланДДС.Сценарий,
		|	БТ_ПланДДС.СтатьяДДС,
		|	БТ_ПланДДС.ПодразделениеКомпании,
		|	БТ_ПланДДС.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(БТ_ПланДДС.Сумма) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Донор.Сценарий КАК Сценарий,
		|	Донор.СтатьяДДС КАК СтатьяДДС,
		|	ЕСТЬNULL(ВБазе.Сумма, 0) - Донор.Сумма КАК Превышение,
		|	Донор.Организация КАК Организация,
		|	Донор.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ Итог
		|ИЗ
		|	Донор КАК Донор
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВБазе КАК ВБазе
		|		ПО Донор.Сценарий = ВБазе.Сценарий
		|			И Донор.СтатьяДДС = ВБазе.СтатьяДДС
		|			И Донор.Организация = ВБазе.Организация
		|			И Донор.ПодразделениеКомпании = ВБазе.ПодразделениеКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Итог.Сценарий КАК Сценарий,
		|	Итог.СтатьяДДС КАК СтатьяДДС,
		|	Итог.Превышение КАК Превышение,
		|	Итог.Организация КАК Организация,
		|	Итог.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ИЗ
		|	Итог КАК Итог
		|ГДЕ
		|	Итог.Превышение < 0"; 
	
	Запрос.УстановитьПараметр("Период", 		КонецМесяца(Объект.ПериодБюджета)-1);
	Запрос.УстановитьПараметр("Донор", 			Объект.Донор.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Отказ = истина;
		Сообщить(СтрШаблон("В таблице дохов привышение:
			| - Статья ДДС: %1
			| - Сценарий: %2
			| - Организация: %3
			| - ПодразделениеКомпании: %4
			| - на сумму: %5",
			Выборка.СтатьяДДС, 
			Выборка.Сценарий, 
			Выборка.Организация, 
			Выборка.ПодразделениеКомпании, 
			-Выборка.Превышение));
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая()  Тогда
		
		Объект.Дата = ТекущаяДата();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериодБюджета) Тогда
		
		Объект.ПериодБюджета 	= НачалоМесяца(ТекущаяДата());
		ПредставлениеПериода 	= Формат(Объект.ПериодБюджета, "ДФ='MMMM yyyy ''г.'''");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодБюджетаРегулирование(Элемент, Направление, СтандартнаяОбработка)   
	
	Объект.ПериодБюджета 	= ДобавитьМесяц(Объект.ПериодБюджета, ?(Направление, 1, -1));
	СтандартнаяОбработка 	= Ложь;
	// Вставить содержимое обработчика.
КонецПроцедуры
